In [45]:
import pandas as pd

In [46]:
df=pd.read_csv("data\survey_results_public.csv")
df_schema=pd.read_csv("data\survey_results_schema.csv")

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:2: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:2: SyntaxWarning: invalid escape sequence '\s'
C:\Users\bakri\AppData\Local\Temp\ipykernel_27948\709305255.py:1: SyntaxWarning: invalid escape sequence '\s'
  df=pd.read_csv("data\survey_results_public.csv")
C:\Users\bakri\AppData\Local\Temp\ipykernel_27948\709305255.py:2: SyntaxWarning: invalid escape sequence '\s'
  df_schema=pd.read_csv("data\survey_results_schema.csv")

##### Lets try on small dataset:

In [47]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}
dfp=pd.DataFrame(people)

In [48]:
dfp

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

##### Display the columns name of a dataset:

In [49]:
dfp.columns
# Notice its a property

Index(['first', 'last', 'email'], dtype='object')

##### How to rename the columns?

In [50]:
# If I want to rename all column => Assignement to a list
dfp.columns=["first name","last name","Email"]

In [51]:
dfp

  first name last name                    Email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

##### Uppercase and Lowercase on my columns:

In [52]:
# Maybe I want to make all columns name upper case => Use list comprehension
dfp.columns=[x.lower() for x in dfp.columns]

In [53]:
dfp

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

##### What if I want to replace a space in coulmns name with underscore?

In [54]:
dfp.columns=dfp.columns.str.replace(" ","_")

In [55]:
dfp

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

##### Updating specific columns name:

In [56]:
dfp.rename(columns={"first_name":"first","last_name":"last"},inplace=True)

In [57]:
dfp

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

##### Updating the Rows:

In [58]:
# How t change all values of the row 
# We can use .loc[index] to call a specific row
# The we assign a list to my row with the new value
dfp.loc[2] =["Bakri","Badet","bakri.badet@gmail.com"]

In [59]:
dfp

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2  Bakri    Badet    bakri.badet@gmail.com

In [60]:
# Change only couple or single value(s)
dfp.loc[1,"first"]="Koko"

In [61]:
dfp

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Koko      Doe        JaneDoe@email.com
2  Bakri    Badet    bakri.badet@gmail.com

In [62]:
# Updating two values:
dfp.loc[0,["first","last"]]=["Omar","Badet"]

In [63]:
dfp

   first   last                    email
0   Omar  Badet  CoreyMSchafer@gmail.com
1   Koko    Doe        JaneDoe@email.com
2  Bakri  Badet    bakri.badet@gmail.com

#### We can do the updating using => .at :

In [64]:
dfp.at[1,"first"]="Jana"

In [65]:
dfp

   first   last                    email
0   Omar  Badet  CoreyMSchafer@gmail.com
1   Jana    Doe        JaneDoe@email.com
2  Bakri  Badet    bakri.badet@gmail.com

In [66]:
# We can use a Filter then we update the value:
filt=(dfp["email"] == "bakri.badet@gmail.com")
dfp[filt]

   first   last                  email
2  Bakri  Badet  bakri.badet@gmail.com

In [67]:
# We can here update the values directly whithin applying the filter
dfp.loc[filt,"last"]="Müller"

In [68]:
dfp

   first    last                    email
0   Omar   Badet  CoreyMSchafer@gmail.com
1   Jana     Doe        JaneDoe@email.com
2  Bakri  Müller    bakri.badet@gmail.com

##### Applying a lower case to my email column:

In [69]:
dfp["email"].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2      bakri.badet@gmail.com
Name: email, dtype: object

In [70]:
# To make this change avialble
dfp["email"]=dfp["email"].str.lower()

In [71]:
dfp

   first    last                    email
0   Omar   Badet  coreymschafer@gmail.com
1   Jana     Doe        janedoe@email.com
2  Bakri  Müller    bakri.badet@gmail.com

##### Lets use the following four methods:
- apply => used for calling a function on our values. It works on dataframe or series.
- map     =>   
- applymap => apply a function to every individual element in the dataframe(works only on data frame). 
- replace  =>

##### Lets start with apply:

In [72]:
# Lets try to check the length of all the emails I have
dfp["email"].apply(len)
# Or
# we can do it this way => dfp["email"].str.len()

0    23
1    17
2    21
Name: email, dtype: int64

In [73]:
# We can use our own defined function in apply():
def update_email(email):
    return email.upper()

In [74]:
dfp["email"].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2      BAKRI.BADET@GMAIL.COM
Name: email, dtype: object

In [75]:
# To make this change active
dfp["email"]=dfp["email"].apply(update_email)

In [76]:
dfp

   first    last                    email
0   Omar   Badet  COREYMSCHAFER@GMAIL.COM
1   Jana     Doe        JANEDOE@EMAIL.COM
2  Bakri  Müller    BAKRI.BADET@GMAIL.COM

In [77]:
# Its a good choice to use lambda function here 
dfp["email"]=dfp["email"].apply(lambda x: x.lower())

In [78]:
dfp

   first    last                    email
0   Omar   Badet  coreymschafer@gmail.com
1   Jana     Doe        janedoe@email.com
2  Bakri  Müller    bakri.badet@gmail.com

##### Lets use apply on Dataframe now:

In [79]:
dfp.apply(len)
# Notice here a not expected values 
# Pandas here not applying the function on every value in the coulmn but on every series
# of the dataframe
# first has three value second has three values and so on

first    3
last     3
email    3
dtype: int64

In [80]:
# Lets pass to the apply function the pd.Series.min function
dfp.apply(pd.Series.min)
# min in strings is the alphbetic which comes first!

first                    Bakri
last                     Badet
email    bakri.badet@gmail.com
dtype: object

##### Lets use applymap():

In [81]:
dfp.applymap(len)
# It will print a data frame with length of every individual element.

C:\Users\bakri\AppData\Local\Temp\ipykernel_27948\3468749934.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  dfp.applymap(len)

   first  last  email
0      4     5     23
1      4     3     17
2      5     6     21

In [82]:
dfp.applymap(str.lower)

C:\Users\bakri\AppData\Local\Temp\ipykernel_27948\3352421018.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  dfp.applymap(str.lower)

   first    last                    email
0   omar   badet  coreymschafer@gmail.com
1   jana     doe        janedoe@email.com
2  bakri  müller    bakri.badet@gmail.com

##### map():

In [83]:
dfp["first"].map({"Omar":"soso","Jana":"koko"})

0    soso
1    koko
2     NaN
Name: first, dtype: object


- This line of code is using the `map` function from pandas DataFrame to replace specific values in the "first" column of the DataFrame `dfp`. 

- The `map` function takes a dictionary as an argument. The keys of the dictionary are the values to be replaced, and the corresponding values in the dictionary are the new values. 

- In this case, it is replacing every occurrence of "omar" with "soso" and "jana" with "koko" in the "first" column of the DataFrame `dfp`.

- Please note that this operation does not modify the original DataFrame `dfp`. If you want to save the changes, you need to assign the result back to the DataFrame column, like this:

- ```python
  dfp["first"] = dfp["first"].map({"omar":"soso","jana":"koko"})
  ```
- All the values that not been modified will be replaced with NaN
- To avoid replacing my not modefied values with NaN => replace()

In [41]:
dfp["first"].replace({"Omar":"soso","Jana":"koko"})

0     soso
1     koko
2    Bakri
Name: first, dtype: object

##### Lets apply these methods on a real world example:

In [84]:
pd.set_option("display.max_columns",85)

In [90]:
# We know in our survey data ConvertedComp is the salary col in $ lets change the name:
df.rename(columns={"ConvertedComp":"SalaryUSD"}, inplace=True)

In [87]:
df["Hobbyist"]

0        Yes
1         No
2        Yes
3         No
4        Yes
        ...
88878    Yes
88879     No
88880     No
88881     No
88882    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [92]:
# Lets replace in Hobbyist every Yes with True and every No with False
df["Hobbyist"].map({"Yes":True,"No":False})

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: bool

In [93]:
df["Hobbyist"]=df["Hobbyist"].map({"Yes":True,"No":False})